/**
 *9201098 - Lukan
 *@author Ronan
 */

 function start() {
    if (cm.getQuestStatus(8223) == 2) {
        if (cm.haveItem(3992041)) cm.sendOk("我们曾经是这里的守护者.现在正向要塞内部渗透,密谋准备向堕落的宗师以及他们的军队发动进攻,你有胆量加入我们吗?");
        else {
            if (!cm.canHold(3992041)) cm.sendOk("请在物品栏中为我给你准备的键石留出一个空位.这是进入绯红堡垒内部密室的必备之物.");
            else {
                cm.sendOk("你弄丢了键石吗?没关系,我会再为你制作一枚.这次要好好保管,别再弄丢了.这是进入绯红堡垒内部密室的必备之物.");
                cm.gainItem(3992041, 1);
            }
        }
    } else {
        cm.sendOk("喔,勇敢的冒险家.我从风暴要塞而来,守护着这片故土不被堕落宗师的卫兵的力量所侵蚀.这股力量日益增长,终有一天会危及周边居民.请帮助我们.");
    }

    cm.dispose();
}
